ejercicios/examen/examen-javascript.tex
% Created 2017-11-27 lun 12:09
% Intended LaTeX compiler: pdflatex
\documentclass[addpoints, 12]{exam}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish]{babel}
\author{Patricio Martínez}
\date{\today}
\title{Examen de JavaScript}
\hypersetup{
 pdfauthor={Patricio Martínez},
 pdftitle={Examen de JavaScript},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.0.50 (Org mode 9.1.3)}, 
 pdflang={Spanish}}
\pagestyle{empty}
\pagenumbering{gobble}
\begin{document}
\maketitle
\begin{enumerate}
\item Qué compañía inventó el lenguaje JavaScript?

\begin{enumerate}
\item Mozilla
\item Netscape
\item Sun
\item Microsoft
\end{enumerate}

\item JavaScript es un lenguaje de programación

\begin{enumerate}
\item Compilado
\item Interpretado
\item No estructurado
\item Ninguna de las anteriores
\end{enumerate}

\item Qué es el DOM

\begin{enumerate}
\item Un atributo
\item Un videojuego
\item Una api para documentos HTML y XML
\item Un elemento
\end{enumerate}

\item Dónde se puede insertar código JavaScript en un documento HTML

\begin{enumerate}
\item En el <head>
\item En el <body>
\item Tanto en el <head> como en el <body>
\item Sólo en el <head> si el documento está en un fichero aparte
\end{enumerate}

\item El DOM representa una página como un

\begin{enumerate}
\item Un árbol
\item Una tabla
\item Una lista hash
\item Ninguna de las anteriores es correcta
\end{enumerate}

\item Cual es el acrónimo de DOM

\begin{enumerate}
\item Document Object Markup
\item Document Of Model
\item Domain Object Model
\item Ninguna de las anteriores son correctas
\end{enumerate}

\item Como se pone en JavaScript un comentario de una línea

\begin{enumerate}
\item \# Comentario
\item // Comentario
\item /* Comentario
\item Ninguna de las anteriores
\end{enumerate}

\item Como se genera en JavasScript un número aleatorio 

\begin{enumerate}
\item Con Math.rnd()
\item Con Math.round()
\item Con Math.random()
\item Ninguna de las anteriores
\end{enumerate}

\item En JavaScript las posiciones de los caracteres de una cadena empiezan en 

\begin{enumerate}
\item -1
\item 0
\item 1
\item Ninguna de las anteriores
\end{enumerate}

\item Cual es la forma correcta de crear un Array en JavaScript

\begin{enumerate}
\item var txt = new Array:1=("tim"),2=("kim"),3=("jim")
\item var txt = new Array(1="tim",2="kim",3="jim")
\item var txt = new Array("tim","kim","jim")
\item var txt = new Array(1:"tim",2:"kim",3:"jim")
\end{enumerate}

\item En JavaScript cual es la función que se emplea para convertir una cadena a minúscula 

\begin{enumerate}
\item lower()
\item lowerCase()
\item toLower()
\item toLowerCase()
\end{enumerate}

\item En JavaScript, ¿cómo se muestra una ventana con el mensaje "Hola mundo!"?

\begin{enumerate}
\item alert("Hola mundo!");
\item alertBox = "Hola mundo!";
\item alertBox("Hola mundo!);
\item msgBox("Hola mundo!);
\end{enumerate}

\item En JavaScript, el operador para concatenar cadenas es

\begin{enumerate}
\item "+"
\item "\%"
\item "."
\item Ninguna de las anteriores
\end{enumerate}

\item En JavaScript, ¿cómo se llama a una función llamada "miFuncion"?

\begin{enumerate}
\item call function miFuncion()
\item call miFuncion()
\item miFuncion()
\item Ninguna de las anteriores es correcta
\end{enumerate}

\item En JavaScript, para obtener un carácter concreto de una cadena según su posición se emplea la función

\begin{enumerate}
\item char()
\item charAt()
\item value()
\item Ninguna de las anteriores
\end{enumerate}

\item En JavaScript, ¿cómo se escribe un bucle "for" para contar desde 1 hasta 5?

\begin{enumerate}
\item for(i <= 5; i++)
\item for(i = 1; i <= 5; i++)
\item for i = 1 to 5
\item Ninguna de las anteriores
\end{enumerate}

\item En JavaScript, ¿cómo se define una función llamada "miFuncion"?

\begin{enumerate}
\item Function:miFuncion()
\item function->miFuncion()
\item function miFuncion()
\item Ninguna de las anteriores es correcta
\end{enumerate}

\item En JavaScript, ¿cómo se escribe una sentencia condicional para comprobar que la variable "i" es igual a 5?

\begin{enumerate}
\item if i=5 then
\item if(i=5)
\item if i==5 then
\item if(i==5)
\end{enumerate}

\item En JavaScript, ¿cómo se redondea el número 7.25 al entero más cercano?

\begin{enumerate}
\item round(7.25)
\item Math.round(7.25)
\item Math.rnd(7.25)
\item rnd(7.25)
\end{enumerate}

\item En JavaScript, para finalizar un bucle de tipo "for" se emplea

\begin{enumerate}
\item No se puede
\item Exit for
\item break
\item Las anteriores respuestas no son correctas
\end{enumerate}

\item En una página XHTML, ¿cuál es la forma correcta de hacer referencia a un fichero externo con código JavaScript llamado "xxx.js"?

\begin{enumerate}
\item <script name="xxx.js" type="text/javascript" />
\item <script href="xxx.js" type="text/javascript" />
\item <script src="xxx.js" type="text/javascript" />
\item Ninguna de las anteriores
\end{enumerate}

\item Respecto al final de instrucción en JavaScript

\begin{enumerate}
\item Se emplea el punto y coma (;), pero es opcional
\item No se emplea ningún delimitador
\item Se emplea el punto y coma (;) y es obligatorio
\item Ninguna es correcta
\end{enumerate}

\item En JavaScript, ¿cómo se calcula el máximo de los números 2 y 4?

\begin{enumerate}
\item ceil(2, 4)
\item top(2, 4)
\item Math.ceil(2, 4)
\item Math.max(2, 4)
\end{enumerate}

\item En JavaScript, ¿cómo se escribe una sentencia condicional para comprobar que la variable "i" es distinta de 5?

\begin{enumerate}
\item if(i <> 5)
\item if(i != 5)
\item if i <> 5
\item if i != 5
\end{enumerate}

\item ¿Qué etiqueta de HTML se emplea para escribir código JavaScript?

\begin{enumerate}
\item <javascript>
\item <script>
\item <scripting>
\item <js>
\end{enumerate}

\item En JavaScript, ¿cómo se llama el objeto que representa una expresión regular?

\begin{enumerate}
\item No hay ningún objeto
\item ExpReg
\item RegExp
\item Rexp
\end{enumerate}

\item JavaScript fue diseñado por

\begin{enumerate}
\item Bill Gates
\item Bjarne Stroustrup
\item Brendan Eich  Brendan Eich
\item Dennis M. Ritchie
\end{enumerate}

\item En una navegador web, para escribir algo en la consola se emplea

\begin{enumerate}
\item console.append()
\item console.log()
\item console.print()
\item console.write()
\end{enumerate}

\item Con Git qué comando usamos para añadir ficheros

\begin{enumerate}
\item Git commit
\item Git push
\item Git add
\item Ninguno de los anteriores
\end{enumerate}

\item Con Git qué comando usamos para subir ficheros al repositorio

\begin{enumerate}
\item Git commit
\item Git push
\item Git add
\item Ninguno de los anteriores
\end{enumerate}
\end{enumerate}
\end{document}
